---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.SpoolName
source: html/5cc4eec1-7ec6-ad73-48b9-b8797f2a00ce.htm
---
# Autodesk.Revit.DB.FabricationPart.SpoolName Property

The spool name of the fabrication part.

## Syntax (C#)
```csharp
public string SpoolName { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: